data_generation/Case1/constant/cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
131948
(
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
74
(
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
172
(
0.635
0.635
0.635
0.635
0.635
0.635
0.635
0.635
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1303
(
0.000405827
0.00121748
0.00202914
0.00284079
0.00365244
0.0044641
0.00527575
0.00608741
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1401
(
-0.000317644
-0.000953366
-0.00158996
-0.00222742
-0.00286575
-0.00350495
-0.00414503
-0.00478598
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
