data_generation/Case1/constant/cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
131948
(
0.0254673
0.0256088
0.0257643
0.0259354
0.0261236
0.0263307
0.0265584
0.026809
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
74
(
0.0254673
0.0256088
0.0257643
0.0259354
0.0261236
0.0263307
0.0265584
0.026809
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
172
(
0.114173
0.113916
0.113653
0.113386
0.113113
0.112835
0.112551
0.112262
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1303
(
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1401
(
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
