data_generation/Case1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          74;
        startFace       262321;
    }
    outlet
    {
        type            patch;
        nFaces          172;
        startFace       262395;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       262567;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       262667;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1303;
        startFace       262767;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1401;
        startFace       264070;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          131948;
        startFace       265471;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          131948;
        startFace       397419;
    }
)

// ************************************************************************* //
